taurus/performance_test/performance_test1.yml
execution:
- executor: gatling
  concurrency: 5
  ramp-up: 5s
  hold-for: 5s
  scenario: scenario-default

# http://gettaurus.org/docs/ScenarioBuilding/
scenarios:
  scenario-default:
    default-address:
    requests:
    - url: /health
      #think-time: 10
      method: GET
      headers:
        Content-Type: application/json
      assert:
      - contains:
        - UP
        subject: body

reporting:
  - module: final-stats
    dump-xml: scenario-default-health-stats.xml