taurus/performance_test/performance_test1.yml
execution:
- executor: gatling
  concurrency: 5
  ramp-up: 5s
  hold-for: 5s
  scenario: scenario-default

# http://gettaurus.org/docs/ScenarioBuilding/
scenarios:
  scenario-default:
    default-address:
    requests:
    - url: /api/courses
      #think-time: 10
      method: GET
      headers:
        Content-Type: application/json
      assert:
      - contains:
        - Course 1
        - Course 2
        - Course 3
        - Course 4
        - Course 5
        subject: body
    - url: /
      #think-time: 10
      method: GET
      headers:
        Content-Type: application/json
      assert:
      - contains:
        - Hello world
        subject: body

reporting:
  - module: final-stats
    dump-xml: scenario-default-health-stats.xml